---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IDockablePaneProvider
source: html/796abfe0-d73a-ddc6-650e-bcd5d3959f62.htm
---
# IDockablePaneProvider Members

Method called during initialization of the user interface to gather information about a dockable pane window.